Courses/4420/Lectures/Hardening/SysCalls/pmNotes-syscalls.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>pmNotes SysCalls [WIP] [Not-On-Web]</title>
<!-- 2018-11-15 Thu 19:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a> | <a href=./>NoSlides</a>
</div>
<div id="content">
<h1 class="title">pmNotes SysCalls [WIP] [Not-On-Web]</h1>

<div id="outline-container-sec-0-1" class="outline-3">
<h3 id="sec-0-1"><span class="section-number-3">0.1</span> bash scripts</h3>
<div class="outline-text-3" id="text-0-1">
<ol class="org-ol">
<li>strace and filter out dupes
<code>strace ls 1&gt;/dev/null 2&gt;/tmp/ls.strace; cat /tmp/ls.strace | cut -d'(' -f1 | sort -u</code>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> PMateti Exploration <code>linux-4.0.5/</code></h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><code># grep sys_call_table /boot/System.map-3.19.0-18-lowlatency</code><br  />
   <code>ffffffff81801680 R sys_call_table</code><br  />
   <code>ffffffff8180d9c0 R ia32_sys_call_table</code><br  />
</li>

<li>The table is in a read-only page.  Need to make this writable.  See
<a href="https://exploit.ph/linux-kernel-hacking/2014/07/10/system-call-hooking/">https://exploit.ph/linux-kernel-hacking/2014/07/10/system-call-hooking/</a>
Welcome to the third post on Linux kernel hacking. In the first we
looked at how to create a basic LKM and in the second we created a
character device and communicated with it.  &#x2026; Here we will
develop an LKM that will hide files from the unix ls command.
</li>

<li><code>grep syscall /boot/System.map-3.19.0-18-lowlatency -n</code> shows 803 hits.
<code>grep syscall /boot/System.map-4.18.0-10-generic | wc -l</code> shows 851
</li>

<li><code>grep 'sys_call_table' /boot/System.map-3.19.0-18-lowlatency -n</code>
</li>

<li><code>grep _text /boot/System.map-3.19.0-18-lowlatency</code> ffffffff81000000
T _text
</li>

<li><code>/usr/src/linux-3.0/include/asm-generic/unistd.h</code>
</li>

<li><code>/usr/src/linux-4.0.5/include/linux/syscalls.h</code>
</li>

<li><code>% grep _unlock_kernel -R /usr/src/linux-4.0.5</code>
</li>
</ol>
<p>
./drivers/misc/sgi-gru/grukservices.c:static void gru<sub>unlock</sub><sub>kernel</sub><sub>context</sub>(int blade<sub>id</sub>)
./drivers/misc/sgi-gru/grukservices.c:  gru<sub>unlock</sub><sub>kernel</sub><sub>context</sub>(uv<sub>numa</sub><sub>blade</sub><sub>id</sub>());
./drivers/misc/sgi-gru/grukservices.c:  gru<sub>unlock</sub><sub>kernel</sub><sub>context</sub>(blade<sub>id</sub>);
Why did I do this??
</p>

<ol class="org-ol">
<li>modinfo signature

<div class="org-src-container">

<pre class="src src-bash">% modinfo /lib/modules/3.19.0-18-lowlatency/kernel/mm/hwpoison-inject.ko 
filename:       /lib/modules/3.19.0-18-lowlatency/kernel/mm/hwpoison-inject.ko
license:        GPL
srcversion:     3511DE2CEE4213EB35BCC1B
depends:        
intree:         Y
vermagic:       3.19.0-18-lowlatency SMP preempt mod_unload modversions 
signer:         Magrathea: Glacier signing key
sig_key:        56:7C:C5:8B:11:79:FD:B3:BB:63:27:71:8E:FA:C1:BD:5C:CB:8C:52
sig_hashalgo:   sha512
</pre>
</div>
</li>

<li><code>syscall_table</code> after <code>% cd /usr/src/linux-4.0.5/arch/</code>

<div class="org-src-container">

<pre class="src src-bash">% ls -lGi */kernel/syscall_table.S  # edited
102503418   7892 Jun  6 11:21 avr32/kernel/syscall_table.S
102894905   9674 Jun  6 11:21 m32r/kernel/syscall_table.S
103026775  10049 Jun  6 11:21 microblaze/kernel/syscall_table.S
103423300  13877 Jun  6 11:21 parisc/kernel/syscall_table.S
</pre>
</div>
</li>
</ol>

<p>
Note the absence of <code>x86/kernel/syscall_table.S</code>
</p>

<div class="org-src-container">

<pre class="src src-bash">% ls -lGi x86/kernel/syscall_*.c
103817339 -rw-rw-r-- 1 pmateti 655 Jun  6 11:21 x86/kernel/syscall_32.c
103817340 -rw-rw-r-- 1 pmateti 853 Jun  6 11:21 x86/kernel/syscall_64.c
</pre>
</div>

<div class="org-src-container">

<pre class="src src-bash">% ls -l x86/syscalls
total 44
-rw-rw-r-- 1 pmateti pmateti  1824 Jun  6 11:21 Makefile
-rw-rw-r-- 1 pmateti pmateti 14671 Jun  6 11:21 syscall_32.tbl
-rw-rw-r-- 1 pmateti pmateti 12754 Jun  6 11:21 syscall_64.tbl
-rw-rw-r-- 1 pmateti pmateti   644 Jun  6 11:21 syscallhdr.sh
-rw-rw-r-- 1 pmateti pmateti   327 Jun  6 11:21 syscalltbl.sh
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> References</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>TBD Prabhaker Mateti, System Call Setup in Linux, 2018.
</li>
<li>Asish Sahadevan, MTech Thesis, Advisor: Prabhaker Mateti, 2015.
</li>
<li><a href="http://www.cs.albany.edu/~sdc/CSI500/Fal11/Labs/L06/OwnSyscall.html">http://www.cs.albany.edu/~sdc/CSI500/Fal11/Labs/L06/OwnSyscall.html</a> Lab on making your own system call.
</li>
</ol>


<ol class="org-ol">
<li><a href="https://www.kernel.org/doc/Documentation/kbuild/modules.txt">https://www.kernel.org/doc/Documentation/kbuild/modules.txt</a>
</li>
<li><a href="http://www.tldp.org/LDP/lkmpg/2.6/html/x181.html">http://www.tldp.org/LDP/lkmpg/2.6/html/x181.html</a>
</li>

<li><a href="https://linux-kernel-labs.github.io/master/labs/kernel_api.html">https://linux-kernel-labs.github.io/master/labs/kernel_api.html</a>
</li>
<li><a href="https://pdos.csail.mit.edu/6.828/2017/labs/lab3/">https://pdos.csail.mit.edu/6.828/2017/labs/lab3/</a>
</li>
<li><a href="https://compas.cs.stonybrook.edu/~nhonarmand/courses/sp17/cse506/labs.html">https://compas.cs.stonybrook.edu/~nhonarmand/courses/sp17/cse506/labs.html</a>
</li>
<li><a href="https://github.com/auca/com.341/tree/master/Practice%202">https://github.com/auca/com.341/tree/master/Practice%202</a>
</li>
<li><a href="https://linux-kernel-labs.github.io/master/">https://linux-kernel-labs.github.io/master/</a> Linux Kernel Teaching, 201x.
</li>
<li><a href="http://learnlinuxconcepts.blogspot.com/2014/03/memory-layout-of-userspace-c-program.html">http://learnlinuxconcepts.blogspot.com/2014/03/memory-layout-of-userspace-c-program.html</a>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>TBD Prune these.  Include reading suggestions.
</li>

<li>Robert Love, Linux Kernel Development, 3rd Edition, Addison Wesley,
2010, 460++ pp, <a href="http://www.makelinux.net/books/lkd2/ch05lev1sec4">http://www.makelinux.net/books/lkd2/ch05lev1sec4</a>
</li>

<li><a href="http://en.wikipedia.org/wiki/System_call">http://en.wikipedia.org/wiki/System_call</a>
</li>

<li>Sunil Gadi, TBD.  Details are obsolete; but the conceptual
discussion of freezing system calls is one of the best.  Highly
Recommended Reading.
</li>

<li><a href="http://unix.stackexchange.com/questions/125343/what-is-meant-by-a-system-call-if-not-the-implementation-in-the-programing-lan">http://unix.stackexchange.com/questions/125343/what-is-meant-by-a-system-call-if-not-the-implementation-in-the-programing-lan</a> April 2014
</li>

<li>David Drysdale, Anatomy of a system call.  Appeared in three parts
in 2014. (i) <a href="http://lwn.net/Articles/604287/">http://lwn.net/Articles/604287/</a> (ii)
<a href="http://lwn.net/Articles/604515/">http://lwn.net/Articles/604515/</a> July 16, 2014
(iii). <a href="http://lwn.net/Articles/604406/">http://lwn.net/Articles/604406/</a>.
</li>

<li>Jonathan Corbet, <a href="http://lwn.net/Articles/475043/">http://lwn.net/Articles/475043/</a> Yet another new
approach to seccomp, January 11, 2012
</li>

<li>Greg Kroah-Hartman, Jonathan Corbet, and Amanda McPherson, "Linux
Kernel Development How Fast it is Going, Who is Doing It, What They
are Doing, and Who is Sponsoring It: An August 2009 Update",
<a href="http://www.linuxfoundation.org/sites/main/files/publications/whowriteslinux.pdf">http://www.linuxfoundation.org/sites/main/files/publications/whowriteslinux.pdf</a>, 2009.
Highly Recommended Reading.
</li>

<li><a href="http://kernelnewbies.org/">http://kernelnewbies.org/</a> Begin here if you wish to learn kernel
devlopment beyond this class room article.  Recommended Visit.
</li>
<li><a href="http://eudyptula-challenge.org/">http://eudyptula-challenge.org/</a> The Eudyptula Challenge is a series
of programming exercises for the Linux kernel, that start from a
very basic "Hello world" kernel module, moving on up in complexity
to getting patches accepted into the main Linux kernel source tree.
{pm: Seems dubious.  No source code!}
</li>

<li><a href="http://www.csee.umbc.edu/courses/undergraduate/CMSC421/fall02/burt/projects/howto_add_systemcall.html">http://www.csee.umbc.edu/courses/undergraduate/CMSC421/fall02/burt/projects/howto_add_systemcall.html</a>
</li>

<li><a href="http://tssurya.wordpress.com/2014/08/19/adding-a-hello-world-system-call-to-linux-kernel-3-16-0/">http://tssurya.wordpress.com/2014/08/19/adding-a-hello-world-system-call-to-linux-kernel-3-16-0/</a>
</li>

<li><a href="https://www.google.com/webhp?&q=linux+arm+syscall+implementation">https://www.google.com/webhp?&q=linux+arm+syscall+implementation</a>
</li>

<li><a href="http://stackoverflow.com/questions/25431095/how-to-implement-system-call-in-arm64">http://stackoverflow.com/questions/25431095/how-to-implement-system-call-in-arm64</a> a good explanation Aug 2014
</li>
<li><a href="https://github.com/android/platform_bionic/blob/master/libc/arch-arm64/syscalls/write.S">https://github.com/android/platform_bionic/blob/master/libc/arch-arm64/syscalls/write.S</a>
</li>
<li><a href="http://infocenter.arm.com/help/topic/com.arm.doc.subset.swdev.abi/index.html">http://infocenter.arm.com/help/topic/com.arm.doc.subset.swdev.abi/index.html</a>
</li>

<li>Jonathan Corbet, <a href="http://lwn.net/Articles/475043/">http://lwn.net/Articles/475043/</a> Yet another new
approach to seccomp, January 11, 2012
</li>

<li><a href="https://filippo.io/linux-syscall-table/">https://filippo.io/linux-syscall-table/</a>  Good. 2014
</li>

<li>Sys Call Implementation Refs
</li>

<li><a href="http://www.cs.swarthmore.edu/~newhall/cs45/s14/Labs/lab02.php">http://www.cs.swarthmore.edu/~newhall/cs45/s14/Labs/lab02.php</a>
</li>

<li><a href="http://stackoverflow.com/questions/25431095/how-to-implement-system-call-in-arm64">http://stackoverflow.com/questions/25431095/how-to-implement-system-call-in-arm64</a>
</li>

<li><a href="http://www.tldp.org/HOWTO/html_single/Implement-Sys-Call-Linux-2.6-i386/">http://www.tldp.org/HOWTO/html_single/Implement-Sys-Call-Linux-2.6-i386/</a>
Good but
obsolete. <a href="https://shanetully.com/2014/04/adding-a-syscall-to-linux-3-14/">https://shanetully.com/2014/04/adding-a-syscall-to-linux-3-14/</a>
updated here.
</li>

<li><a href="http://stackoverflow.com/questions/22274194/implementing-custom-system-call-in-android-kernel">http://stackoverflow.com/questions/22274194/implementing-custom-system-call-in-android-kernel</a>
</li>

<li><a href="http://www.quora.com/How-can-I-hook-system-calls-in-Linux">http://www.quora.com/How-can-I-hook-system-calls-in-Linux</a> The
syscall table is R/O from kernel 2.6.24 onwards, however it's
possible to hook a syscall by disabling page protection using
<code>set_memory_rw</code> (and then enabling it before exiting using
<code>set_memory_ro</code>).  Note.
</li>

<li><a href="http://www.gilgalab.com.br/hacking/programming/linux/2013/01/11/Hooking-Linux-3-syscalls/">http://www.gilgalab.com.br/hacking/programming/linux/2013/01/11/Hooking-Linux-3-syscalls/</a>
   <code>find_sys_call_table()</code> <code>long my_sys_open(const char __user
   *filename, int flags, int mode)</code> Not bad.  <code>printk(KERN_DEBUG "Cannot set the memory to rw (%d) at addr %16lX\n", ret, PAGE_ALIGN(addr) - PAGE_SIZE);</code>
</li>

<li>path name of sys call table file <code>arch/x86/syscalls/syscall_64.tbl</code>
</li>

<li><a href="http://www.ibm.com/developerworks/library/l-system-calls/">http://www.ibm.com/developerworks/library/l-system-calls/</a> Linux®
system calls—we use them every day. But do you know how a system
call is performed from user-space to the kernel? Explore the Linux
system call interface (SCI), learn how to add new system calls (and
alternatives for doing so), and discover utilities related to the
SCI. [This article has been updated to reflect coding changes for
kernels 2.6.18 and later. -Ed.] February 2010 
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Refs-2018</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="http://www.cs.unc.edu/~porter/courses/cse306/s13/lab1.html">http://www.cs.unc.edu/~porter/courses/cse306/s13/lab1.html</a> Due
11:59 PM, Friday, February 15, 2013 3rd part: Text processing using
syscalls, without libc.
</li>

<li><a href="https://sysdig.com/blog/fascinating-world-linux-system-calls/">https://sysdig.com/blog/fascinating-world-linux-system-calls/</a> 2014
</li>
<li><a href="https://www.cs.swarthmore.edu/~newhall/cs45/s14/Labs/lab02.php">https://www.cs.swarthmore.edu/~newhall/cs45/s14/Labs/lab02.php</a>  Add
new syscalls.  Uses VirtualBox.
<a href="https://www.cs.swarthmore.edu/~newhall/unixhelp/virtualbox_lab2.php">https://www.cs.swarthmore.edu/~newhall/unixhelp/virtualbox_lab2.php</a>
</li>

<li><a href="http://www.cs.albany.edu/~sdc/CSI500/Fal13/Labs/OwnSyscallV3plus/OwnSyscallFE.html">http://www.cs.albany.edu/~sdc/CSI500/Fal13/Labs/OwnSyscallV3plus/OwnSyscallFE.html</a>
2013 Uses VirtualBox and Gentoo.vdi Details on syscall impl, and
kernel experience.
</li>
<li><a href="http://trolen.polytech.unice.fr/cours/esa/02-Lab.pdf">http://trolen.polytech.unice.fr/cours/esa/02-Lab.pdf</a>
</li>
<li><a href="http://soc.eurecom.fr/OS/labs_kernel.html">http://soc.eurecom.fr/OS/labs_kernel.html</a> Course on Operating
Systems - Fall 2018 Uses vmplayer.  Lab on hacking the Linux
kernel.  Compiling the Linux kernel. II. Adding a basic system call
to Linux: "kernelprint" system call.  Bonus work: Optimizing the
size of the Linux kernel.  pm: All at a level I like.
</li>
<li><a href="http://www.cs.otago.ac.nz/cosc440/labs/lab01.pdf">http://www.cs.otago.ac.nz/cosc440/labs/lab01.pdf</a>  Rasbian Linux;
Impl cat-equiv.
</li>

<li><a href="https://github.com/tinyclub/linux-0.11-lab/tree/master/examples/syscall">https://github.com/tinyclub/linux-0.11-lab/tree/master/examples/syscall</a>
   How to add a new system call 2017
</li>
<li><a href="http://www.cs.columbia.edu/~krj/os/lectures/L04-IPC.pdf">http://www.cs.columbia.edu/~krj/os/lectures/L04-IPC.pdf</a>
</li>
<li><a href="http://people.clarkson.edu/~jmatthew/os/labs/lab03.pdf">http://people.clarkson.edu/~jmatthew/os/labs/lab03.pdf</a> 16 slides,
Operating Systems, CS 444/544 Spring 2016 Jeanna Matthews
</li>
<li><a href="https://medium.com/@jeremyphilemon/adding-a-quick-system-call-to-the-linux-kernel-cad55b421a7b">https://medium.com/@jeremyphilemon/adding-a-quick-system-call-to-the-linux-kernel-cad55b421a7b</a>
2018? Adding a quick System Call to the Linux Kernel.  Print-Hello
to the log.
</li>
<li><a href="http://www.cs.ucr.edu/~nael/cs153/labs/lab1.html">http://www.cs.ucr.edu/~nael/cs153/labs/lab1.html</a> Lab 1: Fun with
system calls. pm: Not about adding syscalls, but more data members
to the process.
</li>
<li><a href="https://linux-kernel-labs.github.io/master/labs/exercises.html">https://linux-kernel-labs.github.io/master/labs/exercises.html</a>
Built with Sphinx using a theme provided by Read the Docs.  Virtual
Machine Setup; gdb on cmlinux; Exercises; Kernel modules Lab
objectives ; mount -t debugfs none /debug;
<a href="https://github.com/linux-kernel-labs">https://github.com/linux-kernel-labs</a>;
<a href="https://ocw.cs.pub.ro/courses/so2">https://ocw.cs.pub.ro/courses/so2</a>;
<a href="https://elixir.bootlin.com/linux/latest/source">https://elixir.bootlin.com/linux/latest/source</a>; {pm: May be the best hands-on descriptions.}
</li>

<li><a href="https://medium.com/@ssreehari/implementing-a-system-call-in-linux-kernel-4-7-1-6f98250a8c38">https://medium.com/@ssreehari/implementing-a-system-call-in-linux-kernel-4-7-1-6f98250a8c38</a>
Sreehari Computer Science Undergrad | BITS Pilani-Goa | Quizzer |
Speaker Research-TEDxBITSGoa Aug 30, 2016
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> End</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-11-05
</div>
</body>
</html>
